
program zuoye3

    real j(5),d(5),x(5),sum1(3),avg1(3),avg2(5)
    character h(8),l(4)

    data j/76.8,176.5,308.1,41.0,69.6/
    data d/71.5,208.5,352.1,47.2,63.0/
    data x/65.5,200.0,239.7,44.3,63.0/
    data h/'站名','5月','6月','7月','8月','9月','总雨量','平均雨量'/
    data l/'江阴站','定波站','肖山站','平均雨量'/
    data sum1/0.0,0.0,0.0/

    sum1(1) = j(1)+j(2)+j(3)+j(4)+j(5)
    sum1(2) = d(1)+d(2)+d(3)+d(4)+d(5)
    sum1(3) = x(1)+x(2)+x(3)+x(4)+x(5)
    avg1(1) = sum1(1)/5
    avg1(2) = sum1(2)/5
    avg1(3) = sum1(3)/5
    avg2(1) = (j(1)+d(1)+x(1))/3
    avg2(2) = (j(2)+d(2)+x(2))/3
    avg2(3) = (j(3)+d(3)+x(3))/3
    avg2(4) = (j(4)+d(4)+x(4))/3
    avg2(5) = (j(5)+d(5)+x(5))/3

    print*,'站名  ','     5月','      6月','    7月','    8月','     9月','    总雨量','   平均雨量'
    write(*,1)j(1),j(2),j(3),j(4),j(5),sum1(1),avg1(1)
    write(*,2)d(1),d(2),d(3),d(4),d(5),sum1(2),avg1(2)
    write(*,3)x(1),x(2),x(3),x(4),x(5),sum1(3),avg1(3)
    write(*,4)avg2(1),avg2(2),avg2(3),avg2(4),avg2(5)
1   format('江阴站  ',7F8.1)
2   format('定波站  ',7F8.1)
3   format('肖山站  ',7F8.1)
4   format('平均雨量',5F8.1)

end program

